# EDA and Feature Engineering on Flight Prediction Dataset

The important/unique part of the data set is that it has included dat and time parameters and its very inportant to be carefull while dealing with date and time informations.

In [1]:
## importing some important libraries

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
## storing/reading the train data set 
## view first 5 rows of the dataset

train_df = pd.read_excel('Flight_Prediction_Data_Train.xlsx')
train_df.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302

In [3]:
## shape/dimention of the dataset i.e no. of rows and cloumns in the dataset

train_df.shape

(10683, 11)

In [4]:
## storing/reading the train data set 
## view first 5 rows of the dataset

test_df = pd.read_excel('Flight_prediction_Test_set.xlsx')
test_df.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info
0,Jet Airways,6/06/2019,Delhi,Cochin,DEL → BOM → COK,17:30,04:25 07 Jun,10h 55m,1 stop,No info
1,IndiGo,12/05/2019,Kolkata,Banglore,CCU → MAA → BLR,06:20,10:20,4h,1 stop,No info
2,Jet Airways,21/05/2019,Delhi,Cochin,DEL → BOM → COK,19:15,19:00 22 May,23h 45m,1 stop,In-flight meal not included
3,Multiple carriers,21/05/2019,Delhi,Cochin,DEL → BOM → COK,08:00,21:00,13h,1 stop,No info
4,Air Asia,24/06/2019,Banglore,Delhi,BLR → DEL,23:55,02:45 25 Jun,2h 50m,non-stop,No info

In [5]:
## shape/dimention of the dataset i.e no. of rows and cloumns in the dataset

test_df.shape

(2671, 10)

In [6]:
## Merge both train and test datasets

final_df = train_df.append(test_df)
final_df.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897.0
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662.0
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882.0
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218.0
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302.0

In [7]:
final_df.tail()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
2666,Air India,6/06/2019,Kolkata,Banglore,CCU → DEL → BLR,20:30,20:25 07 Jun,23h 55m,1 stop,No info,NaN
2667,IndiGo,27/03/2019,Kolkata,Banglore,CCU → BLR,14:20,16:55,2h 35m,non-stop,No info,NaN
2668,Jet Airways,6/03/2019,Delhi,Cochin,DEL → BOM → COK,21:50,04:25 07 Mar,6h 35m,1 stop,No info,NaN
2669,Air India,6/03/2019,Delhi,Cochin,DEL → BOM → COK,04:00,19:15,15h 15m,1 stop,No info,NaN
2670,Multiple carriers,15/06/2019,Delhi,Cochin,DEL → BOM → COK,04:55,19:15,14h 20m,1 stop,No info,NaN

In [8]:
## shape/dimention of the dataset i.e no. of rows and cloumns in the dataset

final_df.shape

(13354, 11)

In [9]:
## name of the columns present in the dataset

final_df.columns

Index(['Airline', 'Date_of_Journey', 'Source', 'Destination', 'Route',
       'Dep_Time', 'Arrival_Time', 'Duration', 'Total_Stops',
       'Additional_Info', 'Price'],
      dtype='object')

In [10]:
## to get complete info about the data set
## object dtype means it can be categorical data or can be string or numbers

final_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13354 entries, 0 to 2670
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          13354 non-null  object
 1   Date_of_Journey  13354 non-null  object
 2   Source           13354 non-null  object
 3   Destination      13354 non-null  object
 4   Route            13353 non-null  object
 5   Dep_Time         13354 non-null  object
 6   Arrival_Time     13354 non-null  object
 7   Duration         13354 non-null  object
 8   Total_Stops      13353 non-null  object
 9   Additional_Info  13354 non-null  object
 10  Price            10683 non-null  float64
dtypes: float64(1), object(10)
memory usage: 1.2+ MB

In [11]:
## for finding any missing values 

final_df.isna().sum()

Airline               0
Date_of_Journey       0
Source                0
Destination           0
Route                 1
Dep_Time              0
Arrival_Time          0
Duration              0
Total_Stops           1
Additional_Info       0
Price              2671
dtype: int64

Observation: Only Route and total stop has 0ne mmissing values in the complete data set i.e neglectable

# Feature Engineering

## 1. Feature Engineering on Date_of_Journey 
### spliting date, month, and year in differnt column from Date_of_Journey

In [12]:
## Getting date from the Date_of_Journey.
## here created column will be in Object dtype and we will need to convert it into int dtype

final_df['date'] = final_df['Date_of_Journey'].str.split('/').str[0]
final_df['date']

0       24
1        1
2        9
3       12
4       01
        ..
2666     6
2667    27
2668     6
2669     6
2670    15
Name: date, Length: 13354, dtype: object

In [13]:
## Getting month from the Date_of_Journey.
## here created column will be in Object dtype and we will need to convert it into int dtype

final_df['month'] = final_df['Date_of_Journey'].str.split('/').str[1]
final_df['month']

0       03
1       05
2       06
3       05
4       03
        ..
2666    06
2667    03
2668    03
2669    03
2670    06
Name: month, Length: 13354, dtype: object

In [14]:
## Getting year from the Date_of_Journey.
## here created column will be in Object dtype and we will need to convert it into int dtype

final_df['year'] = final_df['Date_of_Journey'].str.split('/').str[2]
final_df['year']

0       2019
1       2019
2       2019
3       2019
4       2019
        ...
2666    2019
2667    2019
2668    2019
2669    2019
2670    2019
Name: year, Length: 13354, dtype: object

In [15]:
## view first 5 rows of the dataset
final_df.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,date,month,year
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897.0,24,03,2019
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662.0,1,05,2019
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882.0,9,06,2019
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218.0,12,05,2019
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302.0,01,03,2019

#### Note:-
Below is the another method to perform the previous task with using lamba function.
This method is more efficient.

In [16]:
## by using lamda function (and this is the more efficient way to code)

# df["Date"]=df['Date_of_Journey'].apply(lambda x:x.split("/")[0])
# df["Month"]=df['Date_of_Journey'].apply(lambda x:x.split("/")[1])
# df["Year"]=df['Date_of_Journey'].apply(lambda x:x.split("/")[2])

# df["Date"]=df['Date_of_Journey'].apply(lambda x:int(x.split("/")[0]))
# df["Month"]=df['Date_of_Journey'].apply(lambda x:int(x.split("/")[1]))

# cols=['date','month','year']
# for i,col in enumerate(cols): 
#     df[col]=df['Date_of_Journey'].apply(lambda x : int(x.split('/')[i]))

In [17]:
## converting the object dtype into int dtype using .astype() function

final_df['date'] = final_df['date'].astype(int)
final_df['month'] = final_df['month'].astype(int)
final_df['year'] = final_df['year'].astype(int)

In [18]:
## to get complete info about the data set

final_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13354 entries, 0 to 2670
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          13354 non-null  object
 1   Date_of_Journey  13354 non-null  object
 2   Source           13354 non-null  object
 3   Destination      13354 non-null  object
 4   Route            13353 non-null  object
 5   Dep_Time         13354 non-null  object
 6   Arrival_Time     13354 non-null  object
 7   Duration         13354 non-null  object
 8   Total_Stops      13353 non-null  object
 9   Additional_Info  13354 non-null  object
 10  Price            10683 non-null  float64
 11  date             13354 non-null  int32
 12  month            13354 non-null  int32
 13  year             13354 non-null  int32
dtypes: float64(1), int32(3), object(10)
memory usage: 1.4+ MB

#### Note:-
Here the Date_of_Journey has been now splited to Date, month and year column. Therefor their is no need of Date_of_Journey column anymore. So we can remove it from the dataset

In [19]:
## removing Date_of_Journey column using .drop() function
## axis = 1 -> for indicating columnwise removal
## inplace=True -> To show the results directly to the dataset and not to create any copy of it.

final_df.drop('Date_of_Journey', axis=1, inplace=True)

In [20]:
## view first 5 rows of the dataset

final_df.head()

,Airline,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,date,month,year
0,IndiGo,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897.0,24,3,2019
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662.0,1,5,2019
2,Jet Airways,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882.0,9,6,2019
3,IndiGo,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218.0,12,5,2019
4,IndiGo,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302.0,1,3,2019

## Feature Engineering on Arrival_time & Dep_Time columns.
1. Splitting the Arrival_time into hours and mins.
2. Splitting the Dep_Time into hours and mins.

In [21]:
## Here we have Arrival_Time with date and months also.
## Therefore we need to remove it and get the time only.
## getting Arrival_time with the help of split()

final_df['Arrival_Time'].str.split(' ').str[0]

0       01:10
1       13:15
2       04:25
3       23:30
4       21:35
        ...
2666    20:25
2667    16:55
2668    04:25
2669    19:15
2670    19:15
Name: Arrival_Time, Length: 13354, dtype: object

In [22]:
## getting Arrival_time with the help of lamda()
final_df['Arrival_Time'] = final_df['Arrival_Time'].apply(lambda x:x.split(' ')[0])
final_df['Arrival_Time']

0       01:10
1       13:15
2       04:25
3       23:30
4       21:35
        ...
2666    20:25
2667    16:55
2668    04:25
2669    19:15
2670    19:15
Name: Arrival_Time, Length: 13354, dtype: object

In [23]:
## Getting Arrival_hour from the Arrival_Time.
## here created column will be in Object dtype and we will need to convert it into int dtype

final_df['Arrival_hour'] = final_df['Arrival_Time'].str.split(':').str[0]
final_df['Arrival_hour']

0       01
1       13
2       04
3       23
4       21
        ..
2666    20
2667    16
2668    04
2669    19
2670    19
Name: Arrival_hour, Length: 13354, dtype: object

In [24]:
## Getting Arrival_min from the Arrival_Time.
## here created column will be in Object dtype and we will need to convert it into int dtype

final_df['Arrival_min'] = final_df['Arrival_Time'].str.split(':').str[1]
final_df['Arrival_min']

0       10
1       15
2       25
3       30
4       35
        ..
2666    25
2667    55
2668    25
2669    15
2670    15
Name: Arrival_min, Length: 13354, dtype: object

In [25]:
## converting the object dtype into int dtype using .astype() function

final_df['Arrival_hour'] = final_df['Arrival_hour'].astype(int)
final_df['Arrival_min'] = final_df['Arrival_min'].astype(int)

In [26]:
## removing Arrival_time column using .drop() function
## axis = 1 -> for indicating columnwise removal
## inplace=True -> To show the results directly to the dataset and not to create any copy of it.

final_df.drop('Arrival_Time', axis=1, inplace=True)

In [27]:
## view first 5 rows of the dataset

final_df.head(2)

,Airline,Source,Destination,Route,Dep_Time,Duration,Total_Stops,Additional_Info,Price,date,month,year,Arrival_hour,Arrival_min
0,IndiGo,Banglore,New Delhi,BLR → DEL,22:20,2h 50m,non-stop,No info,3897.0,24,3,2019,1,10
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,7h 25m,2 stops,No info,7662.0,1,5,2019,13,15

In [28]:
## to get complete info about the data set
## object dtype means it can be categorical data or can be string or numbers

final_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13354 entries, 0 to 2670
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          13354 non-null  object
 1   Source           13354 non-null  object
 2   Destination      13354 non-null  object
 3   Route            13353 non-null  object
 4   Dep_Time         13354 non-null  object
 5   Duration         13354 non-null  object
 6   Total_Stops      13353 non-null  object
 7   Additional_Info  13354 non-null  object
 8   Price            10683 non-null  float64
 9   date             13354 non-null  int32
 10  month            13354 non-null  int32
 11  year             13354 non-null  int32
 12  Arrival_hour     13354 non-null  int32
 13  Arrival_min      13354 non-null  int32
dtypes: float64(1), int32(5), object(8)
memory usage: 1.3+ MB

In [29]:
## getting Arrival_time with the help of lamda()

final_df['Dep_Time'] = final_df['Dep_Time'].apply(lambda x:x.split(' ')[0])
final_df['Dep_Time']

0       22:20
1       05:50
2       09:25
3       18:05
4       16:50
        ...
2666    20:30
2667    14:20
2668    21:50
2669    04:00
2670    04:55
Name: Dep_Time, Length: 13354, dtype: object

In [30]:
## Getting Dep_hour from the Dep_Time.
## here created column will be in Object dtype and we will need to convert it into int dtype

final_df['Dep_hour'] = final_df['Dep_Time'].str.split(':').str[0]
final_df['Dep_hour']

0       22
1       05
2       09
3       18
4       16
        ..
2666    20
2667    14
2668    21
2669    04
2670    04
Name: Dep_hour, Length: 13354, dtype: object

In [31]:
## Getting Dep_min from the Dep_Time.
## here created column will be in Object dtype and we will need to convert it into int dtype

final_df['Dep_min'] = final_df['Dep_Time'].str.split(':').str[1]
final_df['Dep_min']

0       20
1       50
2       25
3       05
4       50
        ..
2666    30
2667    20
2668    50
2669    00
2670    55
Name: Dep_min, Length: 13354, dtype: object

In [32]:
## converting the object dtype into int dtype using .astype() function
final_df['Dep_hour'] = final_df['Dep_hour'].astype(int)
final_df['Dep_min'] = final_df['Dep_min'].astype(int)

In [33]:
## removing Dep_time column using .drop() function
## axis = 1 -> for indicating columnwise removal
## inplace=True -> To show the results directly to the dataset and not to create any copy of it.

final_df.drop('Dep_Time', axis=1, inplace=True)

In [34]:
## view first 2 rows of the dataset

final_df.head(2)

,Airline,Source,Destination,Route,Duration,Total_Stops,Additional_Info,Price,date,month,year,Arrival_hour,Arrival_min,Dep_hour,Dep_min
0,IndiGo,Banglore,New Delhi,BLR → DEL,2h 50m,non-stop,No info,3897.0,24,3,2019,1,10,22,20
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,7h 25m,2 stops,No info,7662.0,1,5,2019,13,15,5,50

In [35]:
## to get complete updated info about the data set after making the changes
## object dtype means it can be categorical data or can be string or numbers

final_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13354 entries, 0 to 2670
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          13354 non-null  object
 1   Source           13354 non-null  object
 2   Destination      13354 non-null  object
 3   Route            13353 non-null  object
 4   Duration         13354 non-null  object
 5   Total_Stops      13353 non-null  object
 6   Additional_Info  13354 non-null  object
 7   Price            10683 non-null  float64
 8   date             13354 non-null  int32
 9   month            13354 non-null  int32
 10  year             13354 non-null  int32
 11  Arrival_hour     13354 non-null  int32
 12  Arrival_min      13354 non-null  int32
 13  Dep_hour         13354 non-null  int32
 14  Dep_min          13354 non-null  int32
dtypes: float64(1), int32(7), object(7)
memory usage: 1.3+ MB

## Feature Engineering on Route Column
Here route and total stops and interrelated and we can drop any one of them after doing some Feature Engineering on it.

In [36]:
## Getting alll the unique values present in Total_stops.

final_df['Total_Stops'].unique()

array(['non-stop', '2 stops', '1 stop', '3 stops', nan, '4 stops'],
      dtype=object)

In [37]:
final_df[final_df['Total_Stops'].isnull()]

,Airline,Source,Destination,Route,Duration,Total_Stops,Additional_Info,Price,date,month,year,Arrival_hour,Arrival_min,Dep_hour,Dep_min
9039,Air India,Delhi,Cochin,NaN,23h 40m,NaN,No info,7480.0,6,5,2019,9,25,9,45

#### Note:-
here route and total_Stops has no value for Delhi to cochin Flight. Therefore we have assumed it to be a flight with one stop and mapped it to 1.

In [38]:
## mapping values according to the stops
final_df['Total_Stops'] = final_df['Total_Stops'].map({'non-stop':0,
         '1 stop':1, '2 stops':2, '3 stops':3, '4 stops':4, 'nan':1
                                                      })

In [39]:
## view first 5 rows of the dataset and checking the updates.
 
final_df.head()

,Airline,Source,Destination,Route,Duration,Total_Stops,Additional_Info,Price,date,month,year,Arrival_hour,Arrival_min,Dep_hour,Dep_min
0,IndiGo,Banglore,New Delhi,BLR → DEL,2h 50m,0.0,No info,3897.0,24,3,2019,1,10,22,20
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,7h 25m,2.0,No info,7662.0,1,5,2019,13,15,5,50
2,Jet Airways,Delhi,Cochin,DEL → LKO → BOM → COK,19h,2.0,No info,13882.0,9,6,2019,4,25,9,25
3,IndiGo,Kolkata,Banglore,CCU → NAG → BLR,5h 25m,1.0,No info,6218.0,12,5,2019,23,30,18,5
4,IndiGo,Banglore,New Delhi,BLR → NAG → DEL,4h 45m,1.0,No info,13302.0,1,3,2019,21,35,16,50

In [40]:
## removing Route column using .drop() function
## axis = 1 -> for indicating columnwise removal
## inplace=True -> To show the results directly to the dataset and not to create any copy of it.

final_df.drop('Route', axis=1, inplace=True)

In [41]:
## view first 2 rows of the dataset and checking the updates made

final_df.head(2)

,Airline,Source,Destination,Duration,Total_Stops,Additional_Info,Price,date,month,year,Arrival_hour,Arrival_min,Dep_hour,Dep_min
0,IndiGo,Banglore,New Delhi,2h 50m,0.0,No info,3897.0,24,3,2019,1,10,22,20
1,Air India,Kolkata,Banglore,7h 25m,2.0,No info,7662.0,1,5,2019,13,15,5,50

## Feature Engineering on Duration Column
Here Duration is mentioned into hours.
We can make the changes by converting it into minitues

In [42]:
## Getting Duration_hour from the Duration.
## here created column will be in Object dtype and we will need to convert it into int dtype

final_df['duration_hour'] = final_df['Duration'].str.split(' ').str[0].str.split('h').str[0]
final_df['duration_hour']

0        2
1        7
2       19
3        5
4        4
        ..
2666    23
2667     2
2668     6
2669    15
2670    14
Name: duration_hour, Length: 13354, dtype: object

In [43]:
## Getting Duration_min from the Duration.
## here created column will be in Object dtype and we will need to convert it into int dtype

final_df['duration_min'] = final_df['Duration'].str.split(' ').str[1].str.split('m').str[0]
final_df['duration_min']

0        50
1        25
2       NaN
3        25
4        45
       ...
2666     55
2667     35
2668     35
2669     15
2670     20
Name: duration_min, Length: 13354, dtype: object

In [45]:
## checking the invalid values present in the duration_hour column
final_df[final_df['duration_hour']=='5m']

,Airline,Source,Destination,Duration,Total_Stops,Additional_Info,Price,date,month,year,Arrival_hour,Arrival_min,Dep_hour,Dep_min,duration_hour,duration_min
6474,Air India,Mumbai,Hyderabad,5m,2.0,No info,17327.0,6,3,2019,16,55,16,50,5m,NaN
2660,Air India,Mumbai,Hyderabad,5m,2.0,No info,NaN,12,3,2019,16,55,16,50,5m,NaN

In [46]:
## removing Row 6474 and 2660 using .drop() function
## axis = 0 -> for indicating rowwise removal
## inplace=True -> To show the results directly to the dataset and not to create any copy of it.

final_df.drop(6474, axis=0, inplace=True)
final_df.drop(2660, axis=0, inplace=True)

In [48]:
## checking for the null values in duration_min column

final_df[final_df['duration_min']=='NaN']

Empty DataFrame
Columns: [Airline, Source, Destination, Duration, Total_Stops, Additional_Info, Price, date, month, year, Arrival_hour, Arrival_min, Dep_hour, Dep_min, duration_hour, duration_min]
Index: []

In [50]:
## filling all the NaN values with 0.

final_df['duration_min']= final_df['duration_min'].fillna(0)
final_df['duration_min']

0       50
1       25
2        0
3       25
4       45
        ..
2666    55
2667    35
2668    35
2669    15
2670    20
Name: duration_min, Length: 13351, dtype: object

In [51]:
## converting the object dtype into int dtype using .astype() function

final_df['duration_hour'] = final_df['duration_hour'].astype(int)
final_df['duration_min'] = final_df['duration_min'].astype(int)

In [52]:
## converting the hours values in final_df['duration_hour'] to mins by multipling it by 60.

final_df['duration_hour_in_min'] = final_df['duration_hour']*60
final_df['duration_hour_in_min']

0        120
1        420
2       1140
3        300
4        240
        ...
2666    1380
2667     120
2668     360
2669     900
2670     840
Name: duration_hour_in_min, Length: 13351, dtype: int32

In [54]:
## Total duration in mins values.

final_df['Total_Duration_in_min'] = final_df['duration_hour_in_min']+final_df['duration_min']
final_df['Total_Duration_in_min']

0        170
1        445
2       1140
3        325
4        285
        ...
2666    1435
2667     155
2668     395
2669     915
2670     860
Name: Total_Duration_in_min, Length: 13351, dtype: int32

In [55]:
final_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13351 entries, 0 to 2670
Data columns (total 18 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Airline                13351 non-null  object
 1   Source                 13351 non-null  object
 2   Destination            13351 non-null  object
 3   Duration               13351 non-null  object
 4   Total_Stops            13350 non-null  float64
 5   Additional_Info        13351 non-null  object
 6   Price                  10681 non-null  float64
 7   date                   13351 non-null  int32
 8   month                  13351 non-null  int32
 9   year                   13351 non-null  int32
 10  Arrival_hour           13351 non-null  int32
 11  Arrival_min            13351 non-null  int32
 12  Dep_hour               13351 non-null  int32
 13  Dep_min                13351 non-null  int32
 14  duration_hour          13351 non-null  int32
 15  duration_min           13351 non-null  int32
 16  duration_hour_in_min   13351 non-null  int32
 17  Total_Duration_in_min  13351 non-null  int32
dtypes: float64(2), int32(11), object(5)
memory usage: 1.4+ MB

Now we can drop duration_hour, duration_min, duration_hour_in_min and Duration columns from the data set

In [57]:
## removing duration_hour, duration_min, duration_hour_in_min and Duration columns from the data set .drop() function
## axis = 1 -> for indicating columnwise removal
## inplace=True -> To show the results directly to the dataset and not to create any copy of it.

final_df.drop('duration_hour', axis=1, inplace=True)
final_df.drop('duration_min', axis=1, inplace=True)
final_df.drop('duration_hour_in_min', axis=1, inplace=True)
final_df.drop('Duration', axis=1, inplace=True)

In [59]:
## view first 2 rows of the dataset

final_df.head(2)

,Airline,Source,Destination,Total_Stops,Additional_Info,Price,date,month,year,Arrival_hour,Arrival_min,Dep_hour,Dep_min,Total_Duration_in_min
0,IndiGo,Banglore,New Delhi,0.0,No info,3897.0,24,3,2019,1,10,22,20,170
1,Air India,Kolkata,Banglore,2.0,No info,7662.0,1,5,2019,13,15,5,50,445

## Moving Froward with other categorical Features.
Categorical features like Additional_Info, Airline, Source, Destination.

In [60]:
## Getting alll the unique values present in Additional_Info.

final_df['Additional_Info'].unique()

array(['No info', 'In-flight meal not included',
       'No check-in baggage included', '1 Short layover', 'No Info',
       '1 Long layover', 'Change airports', 'Business class',
       'Red-eye flight', '2 Long layover'], dtype=object)

In [61]:
## Getting alll the unique values present in Airline.

final_df['Airline'].unique()

array(['IndiGo', 'Air India', 'Jet Airways', 'SpiceJet',
       'Multiple carriers', 'GoAir', 'Vistara', 'Air Asia',
       'Vistara Premium economy', 'Jet Airways Business',
       'Multiple carriers Premium economy', 'Trujet'], dtype=object)

#### Note:- for all these categorical features we will use Label Encoding 
This step can be achieved by importing LabelEncoder from from sklearn.preprocessing.

Here One hot encoder can also be used.

In [62]:
from sklearn.preprocessing import LabelEncoder
labelencoder = LabelEncoder()

In [64]:
final_df['Airline'] = labelencoder.fit_transform(final_df['Airline'])
final_df['Source'] = labelencoder.fit_transform(final_df['Source'])
final_df['Destination'] = labelencoder.fit_transform(final_df['Destination'])
final_df['Additional_Info'] = labelencoder.fit_transform(final_df['Additional_Info'])

In [65]:
final_df.shape

(13351, 14)

In [66]:
final_df.head(2)

,Airline,Source,Destination,Total_Stops,Additional_Info,Price,date,month,year,Arrival_hour,Arrival_min,Dep_hour,Dep_min,Total_Duration_in_min
0,3,0,5,0.0,8,3897.0,24,3,2019,1,10,22,20,170
1,1,3,0,2.0,8,7662.0,1,5,2019,13,15,5,50,445

In [67]:
final_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13351 entries, 0 to 2670
Data columns (total 14 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Airline                13351 non-null  int64
 1   Source                 13351 non-null  int64
 2   Destination            13351 non-null  int64
 3   Total_Stops            13350 non-null  float64
 4   Additional_Info        13351 non-null  int64
 5   Price                  10681 non-null  float64
 6   date                   13351 non-null  int32
 7   month                  13351 non-null  int32
 8   year                   13351 non-null  int32
 9   Arrival_hour           13351 non-null  int32
 10  Arrival_min            13351 non-null  int32
 11  Dep_hour               13351 non-null  int32
 12  Dep_min                13351 non-null  int32
 13  Total_Duration_in_min  13351 non-null  int32
dtypes: float64(2), int32(8), int64(4)
memory usage: 1.1 MB

#### Note:- Every single Features has been properly converted to integer/ float dtype.